#### Dataset for rental houses inÂ nairobi

In [137]:
import pandas as pd

In [138]:
file_path = "data/apartments.csv"

df = pd.read_csv(file_path)

df.head()

,Unnamed: 0,title,location,bedrooms,bathrooms,price,rate
0,0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

#### Data preprocessing

###### drop first coloumn

In [139]:
df = df.drop(df.columns[0], axis=1)

df.head()

,title,location,bedrooms,bathrooms,price,rate
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

In [140]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   object
 5   rate       2520 non-null   object
dtypes: int64(2), object(4)
memory usage: 118.3+ KB

In [141]:
counts = df['rate'].value_counts()

print(counts)

rate
Per Month    2395
Per Day       125
Name: count, dtype: int64

In [142]:
# Removing spaces from 'price' column
df['price'] = df['price'].str.replace(' ', '')

In [143]:

df['price'] = df['price'].astype(int) #convert price into int

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   int32
 5   rate       2520 non-null   object
dtypes: int32(1), int64(2), object(3)
memory usage: 108.4+ KB

In [144]:
df['price']

0       200000
1        70000
2        38000
3        80000
4       110000
         ...
2515     75000
2516     45000
2517     65000
2518    300000
2519    100000
Name: price, Length: 2520, dtype: int32

In [145]:
per_day = df[df['rate'] == 'Per Day']

per_day

,title,location,bedrooms,bathrooms,price,rate
8,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
10,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
31,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
51,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
72,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
...,...,...,...,...,...,...
2425,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2445,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2466,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2488,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2508,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day

In [146]:
df_clean = df.dropna()

df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2144 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2144 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2144 non-null   int64
 3   bathrooms  2144 non-null   int64
 4   price      2144 non-null   int32
 5   rate       2144 non-null   object
dtypes: int32(1), int64(2), object(3)
memory usage: 108.9+ KB

In [147]:
df_clean.isnull().sum()

title        0
location     0
bedrooms     0
bathrooms    0
price        0
rate         0
dtype: int64

In [148]:
per_day = df_clean[df_clean['rate'] == 'Per Day']

per_day

,title,location,bedrooms,bathrooms,price,rate
8,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
10,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
31,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
51,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
72,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
...,...,...,...,...,...,...
2425,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2445,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2466,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2488,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day
2508,1 Bedroom Apartment / Flat to rent in Nyali,"Nyali, Mombasa",1,1,5000,Per Day

In [149]:
# Dropping rows where the 'rate' column is 'Per Day'
df_clean = df_clean[df_clean['rate'] != 'Per Day']

In [150]:
per_day = df_clean[df_clean['rate'] == 'Per Day']

per_day

Empty DataFrame
Columns: [title, location, bedrooms, bathrooms, price, rate]
Index: []

###### drop rate coloumn

In [151]:
df_clean = df_clean.drop('rate', axis=1)

df_clean.head()

,title,location,bedrooms,bathrooms,price
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200000
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70000
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38000
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80000
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110000

In [152]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2019 entries, 0 to 2519
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2019 non-null   object
 1   location   2019 non-null   object
 2   bedrooms   2019 non-null   int64
 3   bathrooms  2019 non-null   int64
 4   price      2019 non-null   int32
dtypes: int32(1), int64(2), object(2)
memory usage: 86.8+ KB

In [153]:
df_clean = df_clean.drop('title', axis=1)

df_clean.head()

                                   location  bedrooms  bathrooms   price
0  Riverside Dr Nairobi, Riverside, Nairobi         3          3  200000
1                       Kileleshwa, Nairobi         3          4   70000
2          Links Rd Mombasa, Nyali, Mombasa         3          2   38000
3    Near Valley Arcade, Lavington, Nairobi         3          3   80000
4                       Kileleshwa, Nairobi         1          1  110000

In [161]:
df_clean['location'].unique()

array(['Riverside Dr Nairobi, Riverside, Nairobi', 'Kileleshwa, Nairobi',
       'Links Rd Mombasa, Nyali, Mombasa',
       'Near Valley Arcade, Lavington, Nairobi',
       'Thika Rd Nairobi, Kahawa Wendani, Nairobi', 'Kilimani, Nairobi',
       'Muthaiga, Nairobi', 'Westlands, Nairobi',
       'Kikuyu Town Bus park Kikuyu, Kikuyu, Kikuyu', 'Shanzu, Mombasa',
       'Westlands downtown, Westlands, Nairobi',
       'Kileleshwa Nairobi, Kileleshwa, Nairobi',
       'Grevillea Grove Spring Valley, Spring Valley, Nairobi',
       'Vihiga road, Kileleshwa, Nairobi',
       'Off Othaya road, Lavington, Nairobi',
       'Jabavu court, Kilimani, Nairobi'], dtype=object)

In [162]:
df_clean['location'].nunique()

16

In [157]:
df_clean.describe()

          bedrooms    bathrooms          price
count  2019.000000  2019.000000    2019.000000
mean      2.624567     2.561664   98834.447746
std       0.930014     1.001751   66556.547553
min       1.000000     1.000000   38000.000000
25%       2.000000     2.000000   55000.000000
50%       3.000000     2.000000   70000.000000
75%       3.000000     3.000000  110000.000000
max       4.000000     5.000000  300000.000000

In [164]:
df_clean.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2514     True
2515     True
2517     True
2518     True
2519     True
Length: 2019, dtype: bool

In [165]:
duplicates = df_clean.duplicated()
print("Number of duplicates:", duplicates.sum())
print(df_clean[duplicates])  # Displaying duplicate rows

Number of duplicates: 2000
                                               location  bedrooms  bathrooms  \
21             Riverside Dr Nairobi, Riverside, Nairobi         3          3
22                                  Kileleshwa, Nairobi         3          4
23                     Links Rd Mombasa, Nyali, Mombasa         3          2
24               Near Valley Arcade, Lavington, Nairobi         3          3
25                                  Kileleshwa, Nairobi         1          1
...                                                 ...       ...        ...
2514            Kileleshwa Nairobi, Kileleshwa, Nairobi         2          2
2515                                  Kilimani, Nairobi         3          3
2517  Grevillea Grove Spring Valley, Spring Valley, ...         2          3
2518                                  Muthaiga, Nairobi         4          5
2519                                 Westlands, Nairobi         2          2

       price
21    200000
22     70000
23     38000
24     80000
25    110000
...      ...
2514   55000
2515   75000
2517   65000
2518  300000
2519  100000

[2000 rows x 4 columns]

In [166]:
# Drop duplicates where all columns match
df_dup = df_clean.drop_duplicates()

df_dup.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19 entries, 0 to 2121
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   location   19 non-null     object
 1   bedrooms   19 non-null     int64
 2   bathrooms  19 non-null     int64
 3   price      19 non-null     int32
dtypes: int32(1), int64(2), object(1)
memory usage: 684.0+ bytes